<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"bb913dea380b53a7841998ff6f64d00efaea1ca40a828cd869adfc0a66b137e6","plan_job_ref":"Job PR Plan #9 at https://github.com/JunzhongLin/johndemo3/actions/runs/12990049854","plan_out_hash":"e0a5d5eab9387524c1d8f98f55b5c7f89e15793927dcaf302f24dae5eccbc63c","plan_hash":"10ede60503544672a2752a144479413d613d30e82f2be787e7b11fb371d79a64","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __terraform__
With backend config files: `terraform/conf/dev.backend.conf`
With var files: `terraform/variables/common.tfvars
terraform/variables/dev.tfvars
`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.stroage_account.azurerm_resource_group.coop-rg will be created
+   resource "azurerm_resource_group" "coop-rg" {
+       id       = (known after apply)
+       location = "northeurope"
+       name     = "coop-rg"
    }

  # module.stroage_account.azurerm_storage_account.example will be created
+   resource "azurerm_storage_account" "example" {
+       access_tier                       = (known after apply)
+       account_kind                      = "StorageV2"
+       account_replication_type          = "LRS"
+       account_tier                      = "Standard"
+       allow_nested_items_to_be_public   = true
+       cross_tenant_replication_enabled  = true
+       enable_https_traffic_only         = true
+       id                                = (known after apply)
+       infrastructure_encryption_enabled = false
+       is_hns_enabled                    = false
+       large_file_share_enabled          = (known after apply)
+       location                          = "northeurope"
+       min_tls_version                   = "TLS1_2"
+       name                              = "johnlinexample3dev"
+       nfsv3_enabled                     = false
+       primary_access_key                = (sensitive value)
+       primary_blob_connection_string    = (sensitive value)
+       primary_blob_endpoint             = (known after apply)
+       primary_blob_host                 = (known after apply)
+       primary_connection_string         = (sensitive value)
+       primary_dfs_endpoint              = (known after apply)
+       primary_dfs_host                  = (known after apply)
+       primary_file_endpoint             = (known after apply)
+       primary_file_host                 = (known after apply)
+       primary_location                  = (known after apply)
+       primary_queue_endpoint            = (known after apply)
+       primary_queue_host                = (known after apply)
+       primary_table_endpoint            = (known after apply)
+       primary_table_host                = (known after apply)
+       primary_web_endpoint              = (known after apply)
+       primary_web_host                  = (known after apply)
+       queue_encryption_key_type         = "*******"
+       resource_group_name               = "coop-rg"
+       secondary_access_key              = (sensitive value)
+       secondary_blob_connection_string  = (sensitive value)
+       secondary_blob_endpoint           = (known after apply)
+       secondary_blob_host               = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_dfs_endpoint            = (known after apply)
+       secondary_dfs_host                = (known after apply)
+       secondary_file_endpoint           = (known after apply)
+       secondary_file_host               = (known after apply)
+       secondary_location                = (known after apply)
+       secondary_queue_endpoint          = (known after apply)
+       secondary_queue_host              = (known after apply)
+       secondary_table_endpoint          = (known after apply)
+       secondary_table_host              = (known after apply)
+       secondary_web_endpoint            = (known after apply)
+       secondary_web_host                = (known after apply)
+       shared_access_key_enabled         = true
+       table_encryption_key_type         = "*******"
+       tags                              = {
+           "environment" = "dev"
        }

+       blob_properties (known after apply)

+       network_rules (known after apply)

+       queue_properties (known after apply)

+       routing (known after apply)

+       share_properties (known after apply)
    }

  # module.stroage_account.azurerm_storage_container.example will be created
+   resource "azurerm_storage_container" "example" {
+       container_access_type   = "private"
+       has_immutability_policy = (known after apply)
+       has_legal_hold          = (known after apply)
+       id                      = (known after apply)
+       metadata                = (known after apply)
+       name                    = "example"
+       resource_manager_id     = (known after apply)
+       storage_account_name    = "johnlinexample3dev"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [PR Plan #9](https://github.com/JunzhongLin/johndemo3/actions/runs/12990049854)